# -*- coding: utf-8 -*-

# 计算股票交易价格序列中的极值点（高点，低点）

from scipy.signal import argrelextrema, argrelmin
import numpy as np
import matplotlib.pyplot as plt

x = np.array(
    [11.6649, 11.4273, 11.5362, 11.3282, 11.0807, 10.4964, 10.8925, 11.0114, 10.9916, 11.1203, 11.1401, 11.0609,
     10.8727, 10.8727, 10.9222, 10.744, 10.9123, 10.8925, 10.8925, 11.0114, 10.546, 10.4073, 9.7934, 9.9815, 9.833,
     10.0211, 9.9518, 10.1202, 10.1499, 10.1598, 9.8231, 9.7241, 8.7536, 8.1595, 8.516, 8.308, 8.7041, 8.922, 8.8923,
     8.8824, 8.9616, 9.0507, 9.0111, 9.1596, 9.1299, 9.1794, 9.229, 9.2091, 9.328, 9.3577, 8.9121, 9.1002, 9.1299,
     9.1101, 9.1794, 9.3577, 9.427, 9.6151, 9.6746, 9.5359, 9.4765, 9.2488, 9.4171, 9.6349, 9.5359, 9.6448, 9.7538,
     9.8726, 9.932, 9.9518, 9.7736, 10.1895, 10.1499, 10.14, 10.57, 10.32, 10.34, 10.17, 10.34, 10.08, 9.94, 10.03,
     10.15, 9.84, 9.75, 9.9, 9.93, 9.9, 10.2, 10.34, 10.31, 10.41, 10.33, 10.31, 10.25, 10.4, 10.66, 10.49, 10.74,
     10.37
])

print(argrelmin(x))

plt.plot(range(0, len(x)), x)
plt.scatter(
    argrelmin(x),
    x[argrelmin(x)],
    c='red'
)
plt.show()

# from scipy import signal
#
# peaks, _ = signal.find_peaks(x, distance=2)  # distance表示极大值点两两之间的距离至少大于等于5个水平单位
#
# print(peaks)
# print(len(peaks))  # the number of peaks
#
# plt.figure(figsize=(20, 5))
# plt.plot(x)
# for i in range(len(peaks)):
#     plt.plot(peaks[i], x[peaks[i]], '*', markersize=10)
# plt.show()
