# -*- coding: utf-8 -*-

from scipy.signal import argrelextrema, argrelmin, savgol_filter
import numpy as np
import matplotlib.pyplot as plt
from scipy import signal
from scipy.interpolate import interp1d
from scipy.misc import derivative


# 将交易价格曲线平滑处理，减少波动
# 目的是提取有价值的极值点（价格极高点，极低点）

# 曲线平滑后，极值点的信息不再准确，不适用

# savgol_filter
def with_savgol_filter(data):
    # 曲线平滑
    # 可视化图线
    x = [i for i in range(1, len(data) + 1)]
    plt.plot(x, data)

    # 使用Savitzky-Golay 滤波器后得到平滑图线
    from scipy.signal import savgol_filter

    y = savgol_filter(data, 9, 1, mode='nearest')
    # 可视化图线
    plt.plot(x, y, 'b', label='savgol')
    plt.show()


if __name__ == '__main__':
    data = np.array(
        [
            5.57, 5.53, 5.3, 5.26, 5.3, 5.11, 4.97, 4.78, 4.71, 4.75, 4.76, 4.69, 4.63, 4.53, 4.65, 4.48, 4.42, 4.45,
            4.32,
            4.37, 4.5, 4.55, 4.63, 4.72, 4.68, 4.61, 4.66, 4.62, 4.55, 4.57, 4.66, 4.75, 4.51, 4.73, 4.83, 4.89, 4.83,
            4.9,
            4.94, 4.9, 4.83, 4.76, 4.79, 4.84, 5.0, 4.94, 4.98, 4.92, 4.95, 4.9, 4.88, 4.86, 4.83, 4.76, 4.88, 4.92,
            4.93,
            4.92, 4.96, 4.97, 4.9, 4.84, 4.82, 4.88, 4.81, 4.78, 4.85, 4.81, 4.54, 4.59, 4.58, 4.5, 4.51, 4.58, 4.58,
            4.53,
            4.52, 4.54, 4.62, 4.57, 4.67, 4.72, 4.8, 4.74, 4.71, 4.75, 4.75, 4.86, 4.88, 4.89, 4.99, 4.97, 5.47, 5.36,
            5.59, 5.6, 5.67, 5.59, 5.63, 5.65, 5.78, 5.79, 5.71, 5.79, 5.91, 5.79, 5.71, 5.78, 5.83, 5.82, 5.79, 5.72,
            5.67, 5.73, 5.82, 5.78, 5.77, 5.72, 5.6, 5.7, 5.73, 5.67, 5.71, 5.68, 5.74, 5.64, 5.73, 5.86, 6.02, 6.04,
            6.14,
            6.25, 6.12, 6.08, 6.09, 6.13, 6.18, 6.23, 6.26, 6.35, 6.2, 6.24, 6.17, 6.27, 6.07, 6.12, 6.08, 6.01, 6.02,
            6.1,
            5.77, 5.93, 5.72, 5.6, 5.57, 5.93, 6.0, 6.08, 6.03, 6.07, 6.05, 6.22, 5.87, 5.95, 5.94, 5.99
        ]
    )

    with_savgol_filter(data)
